[
  {
    "id": 1,
    "acertijo": "Un hombre sin techo recoge colillas de cigarrillos de la calle. Puede hacer un cigarro con cinco colillas. Hoy está de suerte, ha encontrado 25 colillas. ¿Cuántos cigarrillos podrá hacer?",
    "pista": "¡Recuerde, puede utilizar las colillas de los cigarrillos que ha hecho!",
    "respuesta": "6. Puede hacer 5 cigarrillos y después, con las colillas de los 5, puede hacer un cigarrillo más."
  },
  {
    "id": 2,
    "acertijo": "Antes de que el Everest fuera descubierto, ¿cuál era la montaña más alta del mundo?",
    "pista": "¡Simplemente no lo habían descubierto todavía!",
    "respuesta": "¡El Everest! ¡Simplemente no la habían descubierto todavía!"
  },
  {
    "id": 3,
    "acertijo": "¿Qué es lo que no hace preguntas pero necesita ser contestado?",
    "pista": "¡Todas las casas tienen uno!",
    "respuesta": "¡Un teléfono!"
  },
  {
    "id": 4,
    "acertijo": "Un lechero tiene 2 botellas vacías, una de 3 galones y una de 5 galones. Él quiere medir 1 galón exacto. ¿Cómo puede hacer eso?",
    "pista": "El lechero usará la botella de 3 galones primero para vaciar la leche en la botella de 5 galones.",
    "respuesta": "El lechero rellenará la botella de 3 galones y vaciará la leche en la botella de 5 galones. Rellenará la botella de 3 galones de Nuevo y continuará llenando la botella de 5 galones hasta que esté llena. La leche que queda en la botella de 3 galones es exactamente 1 galón."
  },
  {
    "id": 5,
    "acertijo": "¿Cuál es la 'respuesta' de esta suma? \n\n1 + 1 + 1 + 1 + 1\n 1 + 1 + 1 + 1 + 1\n  1 + 1 x 0 + 1 = ?",
    "pista": "Todos los números que puede ver pertenecen a una sola ecuación.",
    "respuesta": "La 'respuesta' es 30. Hay dos trucos en esta pregunta. El primero es 1 por 0. Eso es solo una distracción. Sí, 1 por 0 es 0, pero eso no afecta a lo demás. El Segundo truco es que las líneas que terminan con 1 no tienen un signo de + junto a ellas. Esto significa que deben combinarse con las líneas siguientes. Aquí tiene los números, todos en una línea: \n1 + 1 + 1 + 1 + 11 + 1 + 1 + 1 + 11 + 1 x 0 + 1 = ?"
  },
  {
    "id": 6,
    "acertijo": "Ana nació el 24 de diciembre, pero su cumpleaños es siempre en verano. ¿Cómo es esto posible?",
    "pista": "¿Donde vive Ana?",
    "respuesta": "Vive en el hemisferio sur."
  },
  {
    "id": 7,
    "acertijo": "¿Qué es tan frágil que cuando dice su nombre lo rompe?",
    "pista": "Cuando su nombre es pronunciado, se acaba.",
    "respuesta": "El silencio."
  },
  {
    "id": 8,
    "acertijo": "¿Cómo puede modificar esta ecuación, agregando una sola línea recta, para hacerla correcta? \n5 + 5 + 5 = 550",
    "pista": "Escribe la suma en un papel. Y al agregar la línea recta, la operación sigue siendo una suma",
    "respuesta": "Puede convertir uno de los signos + en un 4. La nueva ecuación es \n545 + 5 = 550."
  },
  {
    "id": 9,
    "acertijo": "Eugenio murió después de una larga vida de 87 años, pero en su tumba escribieron el siguiente epitafio: “Eugenio vivió una buena y larga vida \n–Él amaba a sus hijo y a su bella esposa \n–Él era bueno, generoso y merecía lo mejor \n–Aunque solo tuviera 21 cumpleaños.” ¿Cómo es posible esto?",
    "pista": "Eugenio nació en un día muy especial, que es la 'respuesta'.",
    "respuesta": "Eugenio nació el 29 de febrero en un año bisiesto. Consecuentemente, a sus 87 años, solo tuvo 21 cumpleaños. En los demás años no hubo un 29 de febrero."
  },
  {
    "id": 10,
    "acertijo": "Un caballo está atado a una cuerda de 20 pies. El caballo quiere beber un poco de agua que está a 30 pies de distancia. El caballo llega al agua fácilmente. ¿Cómo es esto posible?",
    "pista": "Toda cuerda tiene dos extremos.",
    "respuesta": "¡El otro extremo de la cuerda no está atado a nada!"
  },
  {
    "id": 11,
    "acertijo": "Si me tienes, me quieres compartir. Si me compartes, ya no me tienes. ¿Qué soy?",
    "pista": "Lo comparte usando su boca.",
    "respuesta": "Un secreto."
  },
  {
    "id": 12,
    "acertijo": "Una chica tenía 13 años en su último cumpleaños, y tendrá 15 años en su próximo cumpleaños. ¿Cómo es esto posible?",
    "pista": "Esto es posible porque hoy es un día muy especial.",
    "respuesta": "Hoy cumple 14 años."
  },
  {
    "id": 13,
    "acertijo": "¿Qué ocurre una en un minuto, dos veces en un momento y nunca en cien años?",
    "pista": "Busca la 'respuesta' dentro de la pregunta.",
    "respuesta": "La letra m."
  },
  {
    "id": 14,
    "acertijo": "Juan y Susana tienen los dos unas manzanas. Si Juan le da una manzana a Susana, ambos tendrán el mismo número de manzanas. Si Susana le da una manzana a Juan, Juan tendrá el doble de manzanas que Susana. ¿Cuántas manzanas tienen cada uno?",
    "pista": "Cada uno tiene menos de diez manzanas.",
    "respuesta": "Juan tiene 7 manzanas y Susana tiene 5 manzanas."
  },
  {
    "id": 15,
    "acertijo": "¿Qué va arriba y abajo pero nunca, nunca se mueve?",
    "pista": "Le ayuda a ir abajo y arriba, también.",
    "respuesta": "Una escalera"
  },
  {
    "id": 16,
    "acertijo": "Este es el único crimen que no puede castigarse si se comete. ¿Qué es?",
    "pista": "Es mejor si solo se lo imagina.",
    "respuesta": "Suicidio."
  },
  {
    "id": 17,
    "acertijo": "Dame comida y viviré. Dame agua y moriré. ¿Qué soy?",
    "pista": "No vive en la tierra.",
    "respuesta": "Fuego."
  },
  {
    "id": 18,
    "acertijo": "Rellenamos una bañera con agua. Si tuviera una cucharilla, una taza y un cubo, ¿qué haría para vaciar la bañera lo antes posible?",
    "pista": "¡Deje de vaciarla a mano!",
    "respuesta": "¡Saque el tapón!"
  },
  {
    "id": 19,
    "acertijo": "¿Qué representa esto? \n24 = HeuD \n26 = LdA \n7 = DdlS \n9 = VduG \n12 = SdZ",
    "pista": "El número de la izquierda indica la cantidad de elementos de la 'respuesta'.",
    "respuesta": "24 horas de un día. 26 letras del alfabeto. 7 días de la semana. 9 vidas de un gato. 12 signos del Zodiaco."
  },
  {
    "id": 20,
    "acertijo": "5 gatos pueden coger 5 ratones en 5 minutos. ¿Cuántos gatos se necesita para coger 100 ratones en 100 minutos?",
    "pista": "¡Haz lo mejor con lo que tengas!",
    "respuesta": "5 gatos. Los mismos cinco podrían seguir cogiendo 5 ratones cada 5 minutos durante 100 minutos."
  },
  {
    "id": 21,
    "acertijo": "Usas un cuchillo para cortarme la cabeza y lloras a mi lado cuando estoy muerta. ¿Qué soy?",
    "pista": "El crimen se cometió en la cocina.",
    "respuesta": "Una cebolla."
  },
  {
    "id": 22,
    "acertijo": "Soy más ligero que una pluma, aun así el más fuerte de los hombres no puede aguantarme por más de dos minutos. ¿Qué soy?",
    "pista": "Es tan ligero como el aire.",
    "respuesta": "Su aliento."
  },
  {
    "id": 23,
    "acertijo": "¿Tienes un guante oscuro en un bolsillo, junto a varios claros. ¿Cuántos guantes debes sacar del bolsillo para asegurarte de tener al menos un par completo?",
    "pista": "No importa si son del mismo par o no. La pregunta es sobre UN par completo.",
    "respuesta": "Debes sacar dos guantes del bolsillo."
  }, 
  {
    "id": 24,
    "acertijo": "Dos madres y dos hijas estaban haciendo tartas. Cada una de ellas hizo una tarta, pero al final solo había tres tartas. ¿Cómo es esto posible?",
    "pista": "Todas las mujeres son de la misma familia.",
    "respuesta": "¡Una chica, su madre y su abuela estaban haciendo las tartas!"
  },
  {
    "id": 25,
    "acertijo": "Dos hombres de un club de ajedrez estaban jugando ajedrez. Jugaron cinco partidas. Cada uno ganó el mismo número de partidas. ¿Cómo es esto posible?",
    "pista": "Estos dos hombres no fueron los únicos que jugaron ajedrez en el club ese día.",
    "respuesta": "Jugaron con personas diferentes."
  },
  {
    "id": 26,
    "acertijo": "¿Qué palabra tiene todas las 26 letras diferentes en ella?",
    "pista": "¡Incluso los niños de primero saben esto!",
    "respuesta": "El alfabeto."
  },
  {
    "id": 27,
    "acertijo": "¿Cómo puede poner 21 naranjas en 4 bolsas y seguir teniendo un número impar en cada bolsa?",
    "pista": "Una bolsa no necesita ser una bolsa pequeña.",
    "respuesta": "Guarda 1, 3, y 5 naranjas en tres bolsas diferentes. Luego guarda en la cuarta bolsa las otras 12 naranjas junto con las primeras tres bolsas que contienen 1, 3, y 5 naranjas. ¡Esto te da 21 naranjas! Y cada bolsa tiene un número impar de cosas dentro. "
  },
  {
    "id": 28,
    "acertijo": "Dos profesores enseñan en la misma escuela. Uno es el padre del hijo del otro. ¿Qué relación tienen?",
    "pista": "¡Es su madre!",
    "respuesta": "Son marido y mujer."
  },
  {
    "id": 29,
    "acertijo": "¿Qué debe tener un bolsillo para que aunque este vacio tenga todavia algo?",
    "pista": "Quizá es la motivo por el que está vacío.",
    "respuesta": "Tienen agujeros."
  },
  {
    "id": 30,
    "acertijo": "Tienes una caja con 3 interruptores en la posición 'apagado'. Cada interruptor controla una bombilla en otra habitación. Solo puedes ir una vez a la otra habitación. ¿Cómo puedes determinar qué interruptor controla cada bombilla?",
    "pista": "Usa una propiedad física de la electricidad además de la luz.",
    "respuesta": "Enciendes un interruptor por unos minutos (para calentarlo), lo apagas y enciendes el segundo. Entras: la bombilla encendida es la #2; la apagada pero caliente es la #1; la apagada y fría es la #3."
  },
  {
    "id": 31,
    "acertijo": "Usted y Margarita tienen la misma cantidad de fresas. ¿Cuántas fresas tiene que darle Margarita para que tenga 10 más que ella?",
    "pista": "La cantidad de fresas que tenéis los dos no importa. 1 fresa que da es una fresa perdida.",
    "respuesta": "Margarita tiene que darle 5 fresas. Cuando le da 5, ella perderá 5 y usted ganará 5 resultando en una diferencia neta de 10. "
  },
  {
    "id": 32,
    "acertijo": "Un hombre caminó bajo una fuerte lluvia durante veinte minutos sin mojarse ni un solo pelo de su cabeza. No llevaba un sombrero, ni un paraguas, ni sujeto nada sobre su cabeza. Su ropa estaba empapada. ¿Cómo fue esto posible?",
    "pista": "¿Piense que tipo de pelo no puede estropearse con la lluvia?",
    "respuesta": "El hombre simplemente no tiene pelo, es calvo."
  },
  {
    "id": 33,
    "acertijo": "¿Qué es negra cuando está limpia y blanca cuando está sucia?",
    "pista": "La usan los maestros.",
    "respuesta": "Una pizarra"
  },
  {
    "id": 34,
    "acertijo": "¿Qué es más grande que Dios, más maligno que el demonio, los pobres lo tienen, los ricos lo necesitan, y si lo come morirá?",
    "pista": "Es lo opuesto de todo.",
    "respuesta": "Nada."
  },
  {
    "id": 35,
    "acertijo": "Tengo manitas pero no puedo dar palmadas. No puedo hablar pero puedo contestar a una pregunta. ¿Qué soy?",
    "pista": "A veces esto es lo único que podría oír en el silencio de una habitación.",
    "respuesta": "Un reloj"
  },
  {
    "id": 36,
    "acertijo": "Un hombre en prisión recibe un visitante. Después el guardia pregunta al preso quién era el visitante. El preso contesta: 'No tengo hermanos ni hermanas, pero el padre de ese hombre es el hijo de mi padre.' ¿Qué parentesco tiene el preso con el visitante?",
    "pista": "El padre del visitante es el hijo del padre del preso.",
    "respuesta": "Es su hijo."
  },
  {
    "id": 37,
    "acertijo": "Siempre la quiere. A veces la puede tener, pero nunca dura para siempre. ¿Qué es?",
    "pista": "Su opuesto trae muerte y destrucción",
    "respuesta": "Paz."
  },
  {
    "id": 38,
    "acertijo": "¿Cuántas veces puede sustraer el número 5 de 20?",
    "pista": "La respuesta no es '4 veces'",
    "respuesta": "Solo una vez. Después de la primera vez que sustrae 5 de 20, ya no es 20."
  },
  {
    "id": 39,
    "acertijo": "Él ha estado en el altar de bodas con muchas mujeres, pero nunca ha estado casado. ¿Quién es él?",
    "pista": "El siempre lleva negro.",
    "respuesta": "Un cura."
  },
  {
    "id": 40,
    "acertijo": "Dos personas nacieron exactamente en el mismo momento, pero no tienen el mismo cumpleaños. ¿Cómo puede ser esto?",
    "pista": "Estas dos personas no viven en el mismo lugar.",
    "respuesta": "Nacieron en lugares distintos, en zonas horarias distintas."
  },
  {
    "id": 41,
    "acertijo": "Aunque se mueran de hambre, los nativos del Ártico nunca se comerán un huevo de pingüino. ¿Por qué no?",
    "pista": "Es porque no han visto muchos pingüinos últimamente. ¿Sabe por qué?",
    "respuesta": "Los pingüinos viven en la Antártida, no en el Ártico."
  },
  {
    "id": 42,
    "acertijo": "Hay dos cuerdas y ambas tardan exactamente 1 hora en quemarse de un cabo al otro. No puede cortar ni doblar las cuerdas. ¿Cómo puede quemar las dos cuerdas para calcular un total de 45 minutos?",
    "pista": "Al quemar una cuerda desde ambos lados al mismo tiempo, la cuerda se quemará por completo en la mitad del tiempo exactamente. Use está técnica.",
    "respuesta": "Queme una de las cuerdas desde ambos lados y la otra cuerda desde un lado. Después de media hora una de las cuerdas se habrá quemado por completo y la otra se habrá quemado por la mitad. En este punto enciende la cuerda restante desde el lado no quemado y tardará 15 minutos para que la otra mitad de la cuerda se queme, un total de 45 minutos."
  },
  {
    "id": 43,
    "acertijo": "Tengo un ojo, pero no puedo ver. Soy tan pequeño que puedes perderme fácilmente. ¿Qué soy yo?",
    "pista": "Una vez un dios dijo que un camello podría pasar a través de mí.",
    "respuesta": "Una aguja. Una vez Jesús dijo, “Y otra vez os digo que es más fácil que un camello pase por el ojo de una aguja, que el que un rico entre en el reino de Dios.”"
  },
  {
    "id": 44,
    "acertijo": "Una cesta contiene 5 manzanas. ¿Sabe cómo dividirla entre 5 niños para que cada uno tenga una manzana y una manzana quede en la cesta?",
    "pista": "El quinto niño pensó que la cesta sería un bonito regalo para su madre.",
    "respuesta": "4 niños reciben una manzana (una manzana para cada uno) ... ¡y el quinto niño recibe la manzana restante con la cesta!"
  },
  {
    "id": 45,
    "acertijo": "Saque uno y rasque mi cabeza, ahora soy negro pero antes era rojo.",
    "pista": "Debe mantenerse fuera del alcance de los niños",
    "respuesta": "Un fósforo."
  },
  {
    "id": 46,
    "acertijo": "Recientemente una madre dio a luz a dos niñas el mismo día, al mismo tiempo, en el mismo mes y año y aun así no son gemelas. ¿Cómo es esto posible?",
    "pista": "Las dos niñas tienen un hermano que no es mayor que sus hermanas",
    "respuesta": "Eran parte de un grupo de trillizos (o de más)."
  },
  {
    "id": 47,
    "acertijo": "¿Dónde puede encontrar calles sin vehículos, bosques sin árboles, y ciudades sin casas?",
    "pista": "Le ayuda a ir a todas partes.",
    "respuesta": "¡En un mapa!"
  },
  {
    "id": 48,
    "acertijo": "Solo tengo dos columnas vertebrales y miles de costillas. Voy por el mundo sin moverme. ¿Qué soy yo?",
    "pista": "Es un invento que conecta ciudades y países.",
    "respuesta": "Ferrocarril"
  },
  {
    "id": 49,
    "acertijo": "¿Qué es lo que se llena con las manos vacías?",
    "pista": "Es algo que viste.",
    "respuesta": "Guantes"
  },
  {
    "id": 50,
    "acertijo": "Una mujer de 62 años y una chica de 16 años entran en un restaurante. Un hombre pasa por su lado y las dos mujeres dicen 'hola padre'. ¿Es esto posible?",
    "pista": "La edad del hombre no tiene nada que ver con la edad de esas dos mujeres.",
    "respuesta": "Ese hombre es un cura."
  },
  {
    "id": 51,
    "acertijo": "¿Qué está lleno de agujeros pero aun así retiene el agua?",
    "pista": "Tiene por lo menos uno en su baño.",
    "respuesta": "Una esponja."
  },
  {
    "id": 52,
    "acertijo": "Un hombre mayor muere, dejando atrás 2 hijos. En su testamento, pide que los hijos compitan con sus caballos: el dueño del caballo más lento recibirá la herencia. Los 2 hijos corren, pero ambos intentan ralentizar a sus caballos. Finalmente, acuden a un sabio para preguntarle qué deberían hacer. Después de eso, los hijos compiten de nuevo, esta vez a toda velocidad. ¿Qué les dijo el sabio?",
    "pista": "Piensa cómo pueden competir a toda velocidad y aún así tener el caballo más lento.",
    "respuesta": "Que se intercambien los caballos."
  },
  {
    "id": 53,
    "acertijo": "Tres cajas cerradas tienen manzanas, plátanos, o ambos, y están etiquetadas “manzanas”, “plátanos” y “mixta”. Sin embargo, cada caja tiene la etiqueta incorrecta en ella. Usted solo puede abrir una caja para ver su contenido. ¿Qué caja debe abrir para averiguar el contenido de las tres cajas?",
    "pista": "No quiere abrir la caja que contiene la fruta mixta porque eso no le ayudaría a determinar cuál de las otras dos cajas es la que tiene las manzanas y cuál tiene los plátanos.",
    "respuesta": "La caja con la etiqueta 'Mixta' no es la caja “Mixta”. Ábrala y saque una fruta. Digamos que es una manzana. Debe ser la caja de las 'manzanas'. La caja marcada 'Plátanos' no es la caja con los plátanos. Tampoco es la caja de las manzanas. Por lo tanto es la caja 'Mixta'. La última caja (etiquetada como 'Manzanas') debe ser la caja con los plátanos. "
  },
  {
    "id": 54,
    "acertijo": "No puede mantener esto hasta que no lo haya dado.",
    "pista": "Tiene que ver con una promesa.",
    "respuesta": "Su palabra."
  },
  {
    "id": 55,
    "acertijo": "¿Qué es suyo pero sus amigos lo usan más que usted?",
    "pista": "Es la manera con la que se dirige a usted.",
    "respuesta": "Su nombre."
  },
  {
    "id": 56,
    "acertijo": "¿A qué pregunta nunca puede contestar 'sí' honestamente?",
    "pista": "Esta es una pregunta que los compañeros de habitación, las parejas y los hermanos se hacen a menudo.",
    "respuesta": "¿Estás dormido?"
  },
  {
    "id": 57,
    "acertijo": "¿Qué es aquello que tiene pico y no come?", 
    "pista": "Quizá el acertijo 2 esté relacionado",
    "respuesta": "Una montaña"
  },
  {
    "id": 58,
    "acertijo": "Jesica tiene dos relojes de arena, uno de 11 minutos y otro de 13 minutos. Quiere medir 15 minutos exactamente. ¿Cómo puede hacer esto?",
    "pista": "Jessica debe usar los dos relojes de arena al mismo tiempo. El reloj de 11 minutos debe volcarse dos veces.",
    "respuesta": "Jesica empezará con ambos relojes, y cuando el reloj de 11 minutos ha terminado, inmediatamente le dará la vuelta otra vez. Cuando el reloj de 13 minutos termina al reloj de 11 minutos le quedarán 9 minutos, así que Jesica le dará la vuelta y durará otros 2 minutos, 13 minutos + 2 minutos = 15 minutos."
  },
  {
    "id": 59,
    "acertijo": "Una mujer se quedó horrorizada al encontrar una mosca en su té. El camarero cogió su taza y fue a la cocina y volvió con otra taza de té. Ella gritó, '¡Me ha traído el mismo té!' ¿Cómo lo supo?",
    "pista": "Ella se dio cuenta en el momento en el que bebió del nuevo té.",
    "respuesta": "Ya le había echado azúcar y cuando bebió del nuevo té estaba ya dulce."
  },
  {
    "id": 60,
    "acertijo": "Es medianoche y está lloviendo. Según las estadísticas del tiempo, ¿qué posibilidades hay de que haga sol dentro de 72 horas?",
    "pista": "¿Cuál es la razón por la que el sol no brilla ahora?",
    "respuesta": "¡Dentro de 72 horas será medianoche otra vez, por lo que no habrá sol!"
  },
  {
    "id": 61,
    "acertijo": "¿Cuál fue el primer planeta que se descubrió?",
    "pista": "El más cerca de usted.",
    "respuesta": "El planeta Tierra."
  },
  {
    "id": 62,
    "acertijo": "En su cajón de calcetines hay 6 calcetines verdes, 4 calcetines azules, 8 calcetines negros, y 2 calcetines rojos. Si está oscuro y no puede ver los colores, ¿cuántos calcetines debería sacar para asegurarse de que tiene un conjunto?",
    "pista": "Es muy poco probable que tenga un conjunto con solo 2 o 3 calcetines.",
    "respuesta": "5 calcetines. Hay 4 colores en total. Usted podría tener 4 calcetines de colores diferentes, pero el quinto tendrá que coincidir con uno de los colores que ya tiene. "
  },
  {
    "id": 63,
    "acertijo": "Dos hombres están en el desierto. Los dos llevan mochila. Uno de ellos está muerto. El que está vivo tiene su mochila abierta, y el que está muerto la tiene cerrada. ¿Qué hay en la mochila?",
    "pista": "Las últimas palabras del hombre muerto fueron ¡'dios mío, no se abre'!",
    "respuesta": "Un paracaídas."
  },
  {
    "id": 64,
    "acertijo": "Según un antiguo libro, el crimen de un hombre causó la eliminación del 25% de la población mundial. ¿Qué crimen fue ese?",
    "pista": "El primer asesinato que tuvo lugar.",
    "respuesta": "Según este, Abel fue matado por su hermano Caín. Abel y Caín fueron los dos hijos de Adán y Eva. Por lo tanto la población fue reducida de 4 a 3."
  },
  {
    "id": 65,
    "acertijo": "No tengo voz pero aun así te hablo. Tengo hojas pero no soy un árbol. Tengo una espina dorsal y bisagras pero no soy ni un hombre ni una puerta. ¿Qué soy yo?",
    "pista": "No es un árbol pero sus hojas están hechas de árbol.",
    "respuesta": "Un libro."
  },
  {
    "id": 66,
    "acertijo": "Está dando un paseo por el parque en un día frío, cuando ve unos objetos en el suelo: Una bufanda, una zanahoria y unos cuantos trozos de carbón. ¿A quién pertenecen?",
    "pista": "Es enero y la semana pasada nevó mucho.",
    "respuesta": "¡Pertenecen a un hombre de nieve que se derritió!"
  },
  {
    "id": 67,
    "acertijo": "Hay tres bombillas en una habitación. En otra habitación hay 3 interruptores que corresponden a estas tres bombillas (en un orden aleatorio) . Está en la habitación de los interruptores y no puede ver las bombillas. Si solo puede visitar la habitación de las bombillas una vez, ¿cómo puede averiguar que interruptor pertenece a cada bombilla?",
    "pista": "Cuando las bombillas se encienden pasan dos cosas: luz Y calor.",
    "respuesta": "Encienda una de las bombillas por un periodo de tiempo lo suficientemente largo como para que se caliente. Después apáguela. Encienda el Segundo interruptor y vaya a la habitación de las bombillas. Habrá una bombilla pagada y caliente (el primer interruptor que encendió), una bombilla que está fría y está encendida (el Segundo interruptor), y una bombilla apagada y fría (el tercer interruptor)."
  },
  {
    "id": 68,
    "acertijo": "¿Qué es lo que siempre viene pero nunca llega?",
    "pista": "Lo esperamos cada día.",
    "respuesta": "El mañana."
  },
  {
    "id": 69,
    "acertijo": "Un hombre conducía su camión. No tenía las luces encendidas. La luna no se veía. En frente, una mujer cruzaba la calle. ¿Cómo la vio?",
    "pista": "¿Por qué no se veía la luna?",
    "respuesta": "Era de día."
  },
  {
    "id": 70,
    "acertijo": "Salen de noche sin ser llamados, y se pierden de día sin ser robados. ¿Qué son?",
    "pista": "¡No los vemos de día!",
    "respuesta": "Estrellas."
  },
  {
    "id": 71,
    "acertijo": "Tú eres mi hermano, pero yo no soy tu hermano. ¿Quién soy yo?",
    "pista": "¡Piensa en la relación que tiene con tu hermano!",
    "respuesta": "Tu hermana."
  },
  {
    "id": 72,
    "acertijo": "Cinco hombres se pasaron toda la noche tocando unos objetos. En la madrugada todos habían conseguido la misma cantidad de dinero. ¿Qué eran estos hombres?",
    "pista": "Estos hombres tocaron unos objetos especiales.", 
    "respuesta": "Músicos."
  },
  {
    "id": 73,
    "acertijo": "Un hombre necesita cruzar un río. Puede coger una barca. Pero la barca solo puede llevar una cosa a la vez. El hombre tiene 3 cosas que tiene que llevar. Un zorro, una oveja, y col. Si llevara el zorro, entonces la oveja se comería la col. Pero si llevara la col, el zorro se comería a la oveja. ¿Cómo puede llevarlos?",
    "pista": "Las cosas que no pueden ir juntas son el zorro y la oveja (el zorro se come a la oveja), y la oveja y la col (la oveja se come la col).",
    "respuesta": "El hombre lleva a la oveja primero (el zorro no se comerá la col). Después le hombre vuelve y se lleva al zorro, pero trae de vuelta a la oveja. Deja a la oveja y se lleva la col al otro lado. Después vuelve de nuevo y se trae a la oveja."
  },
  {
    "id": 74,
    "acertijo": "Sam le dijo a su madre que “’¡El perro de Peter puede saltar por encima de su casa!”. Al principio su madre no creyó eso pero después de que Jorge lo explicará, su madre sonrió y estuvo de acuerdo con que el perro de Peter puede efectivamente saltar sobre su casa. ¿Qué explicó Jorge a su madre?",
    "pista": "¿Por encima de qué casa puede saltar el perro? Piense un poco….",
    "respuesta": "Lo que dijo Sam inicialmente confundió a su madre pero Jorge lo explicó rápidamente: El perro puede saltar por encima de su caseta para perro, no la casa de Peter."
  },
  {
    "id": 75,
    "acertijo": "¿Es posible saltar desde una escalera de 30 pies a un suelo de cemento sin hacerse daño?",
    "pista": "¿Qué hace si sabe que cuanto más alto está más daño se hará?",
    "respuesta": "¡Puede saltar del escalón de abajo!"
  },
  {
    "id": 76,
    "acertijo": "Un hombre vive en la planta número quince de un edificio de apartamentos. Cada mañana coge el ascensor y baja al vestíbulo y sale del edificio. Por la tarde sube al ascensor, y, y si hay otra persona en el ascensor, va a su planta directamente. Sino, va la planta número diez y sube cinco plantas a pie. ¿Por qué hace esto?",
    "pista": "Tiene que ver con un problema que tiene con los botones del ascensor.",
    "respuesta": "El hombre sufre de enanismo. No puede llegar al botón de arriba del ascensor, pero puede pedirle a alguien que lo pulse por él."
  },
  {
    "id": 77,
    "acertijo": "¿Qué tres palabras contienen miles de cartas?",
    "pista": "¡El cartero sabe la 'respuesta'!",
    "respuesta": "Oficina de correos."
  },
  {
    "id": 78,
    "acertijo": "¿Cuándo trae mala suerte ver a un gato blanco?",
    "pista": "Piense en alguien que odia los gatos blancos tanto como a los negros.",
    "respuesta": "Cuando se es un ratón."
  },
  {
    "id": 79,
    "acertijo": "Solo puede darse, no cogerse o comprarse. Lo desea el pecador, pero el santo no. ¿Qué es?",
    "pista": "No puede tenerlo sin arrepentirse primero.",
    "respuesta": "El Perdón."
  },
  {
    "id": 80,
    "acertijo": "Es su cumpleaños y tiene 7 invitados. ¿Cómo puede dividir una tarta de cumpleaños en ocho trozos iguales con solo tres cortes rectos?",
    "pista": "¡Es una tarta de cumpleaños tridimensional!",
    "respuesta": "Corte la tarta en rodajas (dos cortes para hacer cuatro partes) y luego corte la tarta horizontalmente por la mitad, lo que dará 8 trozos iguales."
  },
  {
    "id": 81,
    "acertijo": "Una familia va en el autobús. Todos tienen mucha hambre, y cuando ven un restaurante, pulsan el botón de stop. Son los únicos que bajan del autobús. Una hora más tarde ven las noticias y averiguan que el autobús en el que iban fue aplastado por una roca y la mitad de los pasajeros murieron. Estaban muy impactados pero la madre dijo 'Ojalá no nos hubiéramos bajado nunca.' El padre no podía creerse lo que ella dijo, antes de decir, 'Oh, sí.' ¿Por qué diría esto la madre?",
    "pista": "¿En qué pensó la madre que la hizo sentirse culpable por lo que pasó?",
    "respuesta": "Si no se hubieran bajado, el autobús nunca habría parado y estaría más adelante en la carretera cuando la roca cayó."
  },
  {
    "id": 82,
    "acertijo": "Un niño y su padre van en coche por una carretera cuando se estrellan contra un árbol. El padre murió al instante y el niño fue llevado de inmediato al hospital. Allí, el médico entra y dice ¡¡¡oh, dios mío ese es mi hijo!!! ¿Cómo es esto posible?",
    "pista": "El médico tiene una relación estrecha con el hombre que murió.",
    "respuesta": "El médico es la madre del niño."
  },
  {
    "id": 83,
    "acertijo": "Hay seis vasos en una fila. Los tres primeros están llenos de vino y los otros tres están vacíos. Con solo un movimiento, ¿puede colocarlos para que los vasos llenos y los vacíos se vayan alternando?",
    "pista": "¡Sea ingenioso! También puede mover el contenido del vaso.",
    "respuesta": "Vierta el vino del segundo vaso en el quinto vaso."
  },
  {
    "id": 84,
    "acertijo": "¿Qué es lo que todo el mundo necesita, todo el mundo da, todo el mundo pide y muy pocos toman?",
    "pista": "Puede ser gratuito o puede pagar por él.",
    "respuesta": "Consejo."
  },
  {
    "id": 85,
    "acertijo": "Un hombre está preso en un calabozo. En lo alto de una de las paredes hay una ventana sin barrotes pero está demasiado alto para alcanzarla, por lo que el hombre abandona la esperanza de escapar a través de ella. Él decide cavar su salida. Sin embargo horas después se detiene cuando se da cuenta que tardaría toda su vida en hacer un túnel. Unos días más tarde, una idea viene a su mente, y él comienza a cavar de nuevo. ¿Puede adivinar cuál es su plan?",
    "pista": "Su plan tiene que ver con la ventana sin barrotes.",
    "respuesta": "Quiere recoger la tierra después de cavar y subirse encima de ella para llegar a la ventana."
  },
  {
    "id": 86,
    "acertijo": "Un hombre es encontrado muerto. Los detectives le encontraron colgado con un charco de agua debajo de él. ¿Cómo murió el hombre?",
    "pista": "El asesino colocó algo debajo de los pies del hombre. ¿Qué colocó?",
    "respuesta": "El hombre estaba encima de un bloque de hielo que se derritió."
  },
  {
    "id": 87,
    "acertijo": "Pueden revivir a los muertos. Pueden hacerle llorar o hacerle reír o hacerle joven de nuevo. Nacen en un instante pero duran toda una vida. ¿Qué son?",
    "pista": "Solo viven en nuestra mente.",
    "respuesta": "Recuerdos."
  },
  {
    "id": 88,
    "acertijo": "Tú tienes una, otros tienen dos, un gorila tiene tres y un ser humano tiene cuatro, una personalidad tiene cinco y un ciudadano mundial tiene seis. ¿Qué es?",
    "pista": "Esta 'respuesta' es muy corta.",
    "respuesta": "Vocales."
  },
  {
    "id": 89,
    "acertijo": "Tengo 88 notas pero ninguna es un número. ¿Qué soy?",
    "pista": "Es un objeto que produce música.",
    "respuesta": "Un piano."
  },
  {
    "id": 90,
    "acertijo": "El señor Parker, un hombre de negocios, se va de viaje y pasa por su oficina de camino al aeropuerto, cerca de la medianoche. El vigilante nocturno, Paul le detiene y le dice: 'Sr. Parker, por favor no tome ese vuelo. ¡Tuve un sueño anoche, poco después de medianoche, de que su avión se estrellará y todo el mundo morirá!'  El hombre de negocios cancela su viaje y por supuesto, el avión se estrella, y no hay sobrevivientes. El Sr. Parker le da Pablo una recompensa de $ 20,000 por salvar su vida, y luego le despide. ¿Por qué?",
    "pista": "El vigilante nocturno no debería estar durmiendo mientras trabaja.",
    "respuesta": "Pablo había estado durmiendo mientras trabajaba."
  },
  {
    "id": 91,
    "acertijo": "Soy la parte del pájaro que no está en el cielo. Puedo nadar en el océano y aun así estar seco. ¿Qué soy?",
    "pista": "Es una parte de su cuerpo que no puede tocar.",
    "respuesta": "Sombra."
  },
  {
    "id": 92,
    "acertijo": " Un hombre fue encontrado muerto con una pistola en la mano. Una grabadora se encontró sobre su mesa, a su lado. El detective pulsó el botón de reproducción de la grabadora y escuchó: 'Yo no puedo continuar. No tengo nada en este mundo por que vivir.'Luego se escuchó el sonido de un disparo. El detective dijo de inmediato que se trataba de un asesinato y no un suicidio. ¿Cómo lo supo?",
    "pista": "¡Es tan evddente, que el detective ni siquiera tuvo que rebobinar la cinta para reproducir el mensaje de nuevo!",
    "respuesta": "La cinta empezó al principio del mensaje, por lo que otra persona la había rebobinado y después se había ido de la habitación."
  },
  {
    "id": 93,
    "acertijo": "Cuantos más hace, más deja. ¿Qué son?",
    "pista": "Imagínese caminando por una playa.",
    "respuesta": "Pasos."
  },
  {
    "id": 94,
    "acertijo": "¿Cuántos animales de cada especie cogió Moisés en el Arca?",
    "pista": "Primero, pregúntese: ¿Cuándo construyó el arca, antes o después de liberar a los Hebreos de su esclavitud?",
    "respuesta": "Ninguno, ¡fue Noé el que construyó el arca!"
  },
  {
    "id": 95,
    "acertijo": "Divida 10 entre 1/2 y sume diez. ¿Cuál es la 'respuesta'?",
    "pista": "No es 15.",
    "respuesta": "10: 1/2 = 20. Más 10 = 30."
  },
  {
    "id": 96,
    "acertijo": "Mientras iba a San Ives, me encontré con un hombre con 7 esposas. Cada esposa tenía nueve sacos. Cada saco tenía nueve gatos. Cada gato tenía cinco gatitos. Gatitos, gatos, sacos y esposas, ¿cuántos iban a San Ives?",
    "pista": "Hay una distracción en este 'acertijo'.",
    "respuesta": "Solo yo iba a San Ives."
  },
  {
    "id": 97,
    "acertijo": "Un hombre y una mujer estaban de vacaciones en la India. Entraron en un restaurante y el camarero les trajo dos bebidas. Las bebidas eran las mismas. El hombre bebió su vaso de inmediato, y no le pasó nada malo. La mujer se tomó su tiempo, bebiéndola lentamente. Ella se enfermó una hora más tarde. ¿Por qué?",
    "pista": "Ambos se tomaron un vaso de limonada con hielo.",
    "respuesta": "Los cubitos de hielo estaban hechos con agua contaminada. El hombre lo bebió antes de que el hielo se derritiera."
  },
  {
    "id": 98,
    "acertijo": "Ponga una moneda en una botella vacía e inserte un corcho en el cuello. ¿Cómo se puede sacar la moneda sin quitar el corcho o romper la botella?",
    "pista": "Lo que sube, puede bajar.",
    "respuesta": "Empuje el corcho en la botella. Después saque la moneda."
  },
  {
    "id": 99,
    "acertijo": "Un reloj de sol tiene menos partes móviles que cualquier otro reloj. ¿Cuál tiene más partes móviles que todos?",
    "pista": "Es también uno de los dispositivos más antiguos para medir el tiempo.",
    "respuesta": "Un reloj de arena."
  },
  {
    "id": 100,
    "acertijo": "Si me tumbas, soy todo. Si me cortas por la cintura, me quedo en nada. ¿Qué soy?",
    "pista": "El símbolo que resultas al tumbarme está relacionado con el concepto de infinito.",
    "respuesta": "Un 8. Tumbado, es el símbolo del infinito. Cortado por la mitad, dos ceros (nada)."
  },
  {
    "id": 101,
    "acertijo": "¿Cuántos ladrillos se necesitan para completar un edificio hecho de ladrillos?",
    "pista": "Piensa en el momento justo en que la construcción termina.",
    "respuesta": "Solo uno: el último."
  },
  {
    "id": 102,
    "acertijo": "Una mujer tuvo dos hijos que nacieron a la misma hora del mismo día del mismo año, pero no son gemelos. ¿Cómo es posible?",
    "pista": "Considera que pudo haber más nacimientos además de esos dos.",
    "respuesta": "Eran dos de unos trillizos (o cuatrillizos, o quintillizos o...)."
  },
  {
    "id": 103,
    "acertijo": "Un hombre empuja su coche. Se detiene al llegar a un hotel y de pronto sabe que está arruinado. ¿Qué ha pasado?",
    "pista": "El coche y el hotel son piezas de un conocido juego de mesa.",
    "respuesta": "El hombre estaba jugando al Monopoly con la ficha del coche."
  },
  {
    "id": 104,
    "acertijo": "Estás en un laberinto completamente a oscuras y tienes una vela, una antorcha, un puñado de paja y una sola cerilla. ¿Qué enciendes primero?",
    "pista": "Necesitas la herramienta de ignición para empezar a encender cualquier cosa.",
    "respuesta": "La cerilla."
  },
  {
    "id": 105,
    "acertijo": "¿Qué es lo que no está ni dentro ni fuera de la casa, pero que es necesario para cualquier hogar?",
    "pista": "Permite que entre la luz y te permite ver el exterior desde el interior.",
    "respuesta": "Las ventanas."
  },
  {
    "id": 106,
    "acertijo": "El hombre que lo vendió no lo quería. El hombre que lo compró no lo necesitaba. El hombre que lo usó no lo conocía.",
    "pista": "Es un objeto asociado con el final de la vida.",
    "respuesta": "Un ataúd."
  },
  {
    "id": 107,
    "acertijo": "20+20+20=60. ¿Cómo puedes hacer 60 nuevamente usando el mismo número 3 veces?",
    "pista": "El número que necesitas usar tiene que ser un '5'.",
    "respuesta": "55+5=60."
  },
  {
    "id": 108,
    "acertijo": "Tom mide 1,80, es ayudante en una carnicería y lleva zapatos de la talla 45. ¿Qué pesa?",
    "pista": "La pregunta no es sobre el peso de Tom, sino sobre su profesión.",
    "respuesta": "Carne."
  },
  {
    "id": 109,
    "acertijo": "El señor y la señora García–Palomeque tienen seis hijas y cada hija tiene un hermano. ¿Cuántas personas hay en la familia García–Palomeque?",
    "pista": "Todas las hijas comparten al mismo hermano.",
    "respuesta": "Hay nueve García–Palomeque en la familia (Sra., Sr., 6 hijas y 1 hijo)."
  },
  {
    "id": 110,
    "acertijo": "Un taxista va borracho (y puede que algo más) por una calle en dirección contraria a todos los coches. Entre ellos aparece un coche de policía pero sigue su camino y no hace absolutamente nada por detenerle. ¿Por qué se ha librado?",
    "pista": "Piensa en el medio de transporte que usa el 'taxista'.",
    "respuesta": "Porque el taxista va andando."
  },
  {
    "id": 111,
    "acertijo": "Un hombre entra en un bar y pide al camarero un vaso de agua. El camarero saca una pistola y le apunta. El hombre dice 'gracias' y se va. ¿Qué ha pasado?",
    "pista": "El camarero curó al hombre de un problema físico común con el susto.",
    "respuesta": "El hombre tenía hipo. El camarero lo asustó, curándole el hipo, por lo que ya no necesitaba el agua."
  },
  {
    "id": 112,
    "acertijo": "Si en un grupo de 30 personas, cada una tiene la mitad de las personas a su derecha y la mitad de las personas a su izquierda, ¿cuántas personas hay en total?",
    "pista": "Piensa en el número de personas a la izquierda y derecha del último individuo.",
    "respuesta": "Hay 31 personas en total. Si alguien tiene 15 personas a su derecha y 15 a su izquierda (15+15=30), más él (1), son 31."
  },
  {
    "id": 113,
    "acertijo": "Un hombre vive en el décimo piso de un edificio. Todos los días coge el ascensor para bajar a la planta baja. Cuando vuelve, sube hasta la séptima planta y sube las escaleras. Odia caminar, ¿por qué lo hace?",
    "pista": "El problema no es de lógica, sino de accesibilidad física a los botones del ascensor.",
    "respuesta": "Debido a su baja estatura, el hombre no puede alcanzar más que el botón del séptimo piso."
  },
  {
    "id": 114,
    "acertijo": "A un explorador le dieron a elegir cómo palmar: 'Si la última frase que pronuncies es cierta, morirás cocido en una olla; si la última frase que digas falsa, morirás quemado en la hoguera'. ¿Qué dijo el explorador para salir vivo de esa situación?",
    "pista": "Debe decir una frase que cree una paradoja irresoluble.",
    "respuesta": "'Moriré quemado en la hoguera'. (Si lo queman, la frase sería cierta, por lo que deberían cocerlo. Si lo cuecen, la frase sería falsa, por lo que deberían quemarlo.)"
  },
  {
    "id": 115,
    "acertijo": "Marco Antonio y Cleopatra yacen muertos en el suelo de una villa en Egipto. Cerca de ellos hay cristales rotos. No hay ninguna marca en sus cuerpos y no fueron envenenados. ¿Cómo murieron?",
    "pista": "Marco Antonio y Cleopatra son nombres comunes para unas mascotas acuáticas.",
    "respuesta": "Marco Antonio y Cleopatra eran peces de colores cuya pecera (de cristal) fue derribada por un perro torpe."
  },
  {
    "id": 116,
    "acertijo": "Un asesino es condenado a muerte. Tiene que elegir entre tres habitaciones. La primera está llena de ninjas, la segunda está repleta de mercenarios con armas y la tercera está llena de leones muertos de hambre. ¿Qué habitación es la más segura para él?",
    "pista": "Presta mucha atención al estado en el que se encuentran los leones.",
    "respuesta": "La tercera habitación, porque esos leones ya están muertos."
  },
  {
    "id": 117,
    "acertijo": "El dueño de una tienda de animales tiene un loro con un cartel en su jaula que decía 'el loro repite todo lo que oye'. Un joven lo compra y durante dos semanas le habla y no dice ni una palabra. ¿Cómo puede ser?",
    "pista": "El loro 'oye' la verdad del cartel, pero no puede oír las palabras del joven.",
    "respuesta": "¡El loro era sordo!"
  },
  {
    "id": 118,
    "acertijo": "Un hombre está atrapado en una habitación. Tiene dos puertas. La primera tiene una lupa que fríe instantáneamente a cualquiera con el sol. La segunda tiene un dragón que escupe fuego. ¿Cómo escapa el hombre?",
    "pista": "La lupa funciona con energía solar.",
    "respuesta": "Espera a que se haga de noche y entonces pasa por la primera puerta."
  },
  {
    "id": 119,
    "acertijo": "Un hombre muere y se va al cielo. Vio a Adán y Eva. ¿Cómo lo supo?",
    "pista": "Piensa en las consecuencias de su nacimiento y que nunca fueron gestados.",
    "respuesta": "Porque eran las únicas personas sin ombligo."
  },
  {
    "id": 120,
    "acertijo": "En la granja de Don Álvaro una gallina y media ponen un huevo y medio en un día y medio. ¿Cuántos huevos pone una gallina en un día?",
    "pista": "Si la tasa de producción es constante, simplifica la relación de las 'medias'.",
    "respuesta": "Dos tercios de un huevo. (1 gallina pone 1 huevo en 1.5 días. En 1 día pone $1 / 1.5 = 2/3$ de huevo)."
  },
  {
    "id": 121,
    "acertijo": "¿Cuál es el siguiente número de esta serie: 3.829, 9.382, 2.938…?",
    "pista": "Observa el movimiento del último dígito en cada paso.",
    "respuesta": "8.293. El último dígito se mueve al frente para formar el siguiente número."
  },
  {
    "id": 122,
    "acertijo": "Diez amigos contribuyen a un bote. Dos se echan atrás. Los 8 restantes tuvieron que aportar 10 euros más para recuperar la cantidad. ¿Cuánto dinero pensaban recaudar entre todos al principio?",
    "pista": "La diferencia de lo que aportaron los 8 (8 x 10 = 80) es el total que debían aportar los dos que se echaron atrás.",
    "respuesta": "400 euros. Cada uno inicialmente aportaba $80 / 2 = 40 euros. Total: 10 x 40 = 400."
  },
  {
    "id": 123,
    "acertijo": "Encuentra el número de cuatro dígitos en el que el primer dígito es un cuarto del último, el segundo es 6 veces el primero y el tercero es el segundo más 3. ¿Qué es?",
    "pista": "Empieza por el primer dígito (solo puede ser 1 o 2) y luego calcula los demás en orden.",
    "respuesta": "1694. (1 es 1/4 de 4. 6 es 6 veces 1. 9 es 6 más 3)."
  },
  {
    "id": 124,
    "acertijo": "Cuando mi padre, Benjamin Button, tenía 31 años yo tenía 8. Ahora tiene el doble de años que yo. ¿Qué edad tengo?",
    "pista": "La diferencia de edad entre padre e hijo nunca cambia.",
    "respuesta": "Tengo 23 años. La diferencia de edad es $31 - 8 = 23$. Si el padre tiene el doble de mi edad (2x), entonces $2x - x = 23$, por lo tanto, $x = 23$."
  },
  {
    "id": 125,
    "acertijo": "Tengo cuatro veces la edad de mi hija, María. Dentro de 20 años tendré el doble de años que ella. ¿Qué edad tenemos ahora?",
    "pista": "Usa M para la edad de María y 4M para la tuya. Plantea una ecuación para dentro de 20 años.",
    "respuesta": "Yo tengo 40 y María, 10. (Ecuación: $4M + 20 = 2(M + 20)$)."
  },
  {
    "id": 126,
    "acertijo": "¿Puedes escribir ocho ochos para que sumen mil?",
    "pista": "Necesitas combinar algunos ochos para formar números de dos y tres dígitos.",
    "respuesta": "888 + 88 + 8 + 8 + 8 = 1000."
  },
  {
    "id": 127,
    "acertijo": "Tienes un cajón con 10 calcetines negros y 10 blancos. Cierras los ojos y sacas tres calcetines. ¿Tienes un par de calcetines iguales?",
    "pista": "Solo hay dos colores posibles. Piensa en el peor escenario al sacar tres.",
    "respuesta": "Sí. Con solo dos colores, al sacar el tercer calcetín, este debe necesariamente coincidir con uno de los dos primeros, formando un par."
  },
  {
    "id": 128,
    "acertijo": "Coge dos números, tales que el cuadrado del primero más el cuadrado del segundo sean 8; mientras que el primero, más el producto del primero y el segundo, será igual a 6. ¿Cuáles son los dos números?",
    "pista": "Sustituye mentalmente números pequeños e iguales en las dos ecuaciones.",
    "respuesta": "2 y 2. (Ecuación 1: 2^2 + 2^2 = 8. Ecuación 2: 2 + (2x2) = 6)."
  },
  {
    "id": 129,
    "acertijo": "¿Cuántas veces puedes restar el número 5 de 25?",
    "pista": "Después de la primera resta, el número ya no es 25.",
    "respuesta": "Una única vez, lechón, porque después de restar ya no es 25."
  },
  {
    "id": 130,
    "acertijo": "El otro día estaba en casa con un amigo y me vine arriba con el siguiente reto: '¿A que soy capaz de beberme seis vasos de cerveza antes de que te bebas tú un chupito de Jagger? Solo pongo tres condiciones: tú no puedes tocar mis vasos, yo no puedo tocar el tuyo y me tienes que dar un vaso de ventaja'. ¿Cómo fui capaz de ganar?",
    "pista": "Usa uno de tus vasos vacíos como herramienta.",
    "respuesta": "Me bebí mi primer vaso de cerveza. Una vez vacío, cubrí con ese mismo vaso el chupito de mi amigo. A partir de ahí, me pude beber el resto de mis vasos con la calma."
  },
  {
    "id": 131,
    "acertijo": "Jaime quiere hervir un huevo en dos minutos. Si solo tiene un temporizador de tres minutos (reloj de arena), un temporizador de cuatro minutos y un temporizador de cinco minutos, ¿cómo puede hervir el huevo solo dos minutos?",
    "pista": "Usa la diferencia entre dos temporizadores para medir el tiempo.",
    "respuesta": "Gira el temporizador de tres minutos y el de cinco minutos. Cuando el de tres minutos se agote, pon el huevo en el agua. Cuando el de cinco minutos se agote (han pasado $5-3 = 2$ minutos desde que pusiste el huevo), sácalo."
  },
  {
    "id": 132,
    "acertijo": "Si estás a 2,4 metros de una puerta y con cada movimiento avanzas la mitad de la distancia hasta la puerta. ¿Cuántos movimientos necesitarás para llegar a la puerta?",
    "pista": "Piensa si puedes dividir algo infinitamente.",
    "respuesta": "Nunca llegarás a la puerta, ya que solo puedes recorrer la mitad de la distancia, por pequeña que sea."
  },
  {
    "id": 133,
    "acertijo": "Dos personas nacen en el mismo momento, pero no tienen la misma fecha de nacimiento. ¿Cómo puede ser?",
    "pista": "Esto es un acertijo relacionado con la geografía.",
    "respuesta": "Han nacido en zonas horarias diferentes."
  },
  {
    "id": 134,
    "acertijo": "Cuando Benancio del Toro tenía seis años, clavó un clavo en su árbol favorito para marcar su altura. Diez años después, el árbol creció cinco centímetros cada año. ¿Cuánto más alto sería el clavo?",
    "pista": "Los árboles solo crecen en la parte superior, no elevan todo su tronco.",
    "respuesta": "El clavo estaría a la misma altura, ya que los árboles crecen por su parte superior."
  },
  {
    "id": 135,
    "acertijo": "Alicia mira a Roberto y Roberto mira a Carlos. Alicia está casada, Carlos no. ¿Una persona casada está mirando a una persona soltera?",
    "pista": "Considera las dos posibilidades para el estado civil de Roberto.",
    "respuesta": "Sí. Si Roberto está casado, mira al soltero Carlos. Si Roberto es soltero, la casada Alicia le está mirando. En ambos casos, la afirmación es cierta."
  },
  {
    "id": 136,
    "acertijo": "En el Tour de Francia, ¿cuál es la posición de un corredor después de pasar al segundo clasificado?",
    "pista": "Si pasas al segundo, ¿quién queda justo delante de ti?",
    "respuesta": "El segundo. Si pasas al segundo, tú ocupas su lugar."
  },
  {
    "id": 137,
    "acertijo": "Un hombre conducía un camión negro. Las luces no estaban encendidas. No había luna. Una señora cruzaba la calle. ¿Cómo la vio el hombre?",
    "pista": "No asumas que era de noche solo porque las luces y la luna estaban ausentes.",
    "respuesta": "Era un día luminoso y soleado."
  },
  {
    "id": 138,
    "acertijo": "Una pera cuesta 40 céntimos, una banana 60 céntimos y una ciruela 80 céntimos. ¿Cuánto cuesta una manzana?",
    "pista": "El precio está relacionado con las vocales del nombre de la fruta.",
    "respuesta": "60 céntimos. El precio se calcula multiplicando el número de vocales por 20 (Manzana tiene 3 vocales: 3 x 20 = 60)."
  },
  {
    "id": 139,
    "acertijo": "Un tipo malo está jugando a la ruleta rusa con un revólver de seis tiros. Pone una bala, hace girar la recámara y te dispara, pero no sale ninguna bala. Te da a elegir si debe volver a girar la recámara antes de disparar por segunda vez. ¿Debe girar de nuevo?",
    "pista": "Compara las probabilidades antes y después de eliminar una posición vacía.",
    "respuesta": "Sí. Antes de volver a girar, la bala está en uno de los 5 huecos restantes (1/5 de probabilidad de morir). Si vuelve a girar, la probabilidad de morir es 1/6, lo cual es más seguro."
  },
  {
    "id": 140,
    "acertijo": "Nico dice de su hermano menor: “Hace dos años, yo tenía tres veces la edad de mi hermano. Dentro de tres años tendré el doble de la edad de mi hermano”. ¿Qué edad tienen cada uno ahora?",
    "pista": "Sean N y H las edades actuales. Plantea el sistema de ecuaciones: $N-2 = 3(H-2)$ y $N+3 = 2(H+3)$.",
    "respuesta": "Nico tiene 17 años y su hermano menor, 7. (Hace dos años: 15 y 5. Dentro de tres años: 20 y 10)."
  },
  {
    "id": 141,
    "acertijo": "Una niña se encuentra con un león y un unicornio en el bosque. El león miente L, M y X. El unicornio miente J, V y S. 'Ayer mentí', le dice el león a la niña. 'Yo también', dice el unicornio. ¿Qué día es?",
    "pista": "Analiza las combinaciones de 'Hoy' y 'Ayer' para el león y el unicornio.",
    "respuesta": "Jueves. (Si el león dice la verdad, ayer fue Miércoles. El único día que el unicornio dice que mintió ayer (Miércoles) y dice la verdad (Jueves) es Jueves)."
  },
  {
    "id": 142,
    "acertijo": "Venga, esta es fácil. ¿El triple de qué número no es mayor que el doble del mismo número?",
    "pista": "La única forma de que 3X = 2X es si X es igual a...",
    "respuesta": "Cero."
  },
  {
    "id": 143,
    "acertijo": "Cinco trozos de carbón, una zanahoria y una bufanda están tirados en el césped. Nadie los puso allí, pero hay una razón perfectamente lógica para que estén ahí. ¿Qué ha pasado?",
    "pista": "Estos elementos se usan para decorar una figura hecha de nieve.",
    "respuesta": "Fueron utilizados por los niños que hicieron un muñeco de nieve, y este ya se ha derretido."
  },
  {
    "id": 144,
    "acertijo": "¿Qué es rojo pero huele a pintura azul?",
    "pista": "La respuesta es la cosa en sí, no una metáfora.",
    "respuesta": "La pintura roja."
  },
  {
    "id": 145,
    "acertijo": "Si un gallo pone un huevo en lo alto de una montaña y el viento sopla de este a oeste, ¿hacia qué lado caerá el huevo?",
    "pista": "Recuerda la biología básica del gallo.",
    "respuesta": "Hacia ninguno, los gallos no ponen huevos."
  },
  {
    "id": 146,
    "acertijo": "¿Cuál es el animal que tiene más dientes?",
    "pista": "Piensa en un personaje de fantasía asociado a los dientes.",
    "respuesta": "El ratoncito Pérez."
  },
  {
    "id": 147,
    "acertijo": "Este banco está ocupado por un padre y un hijo. El padre se llama Juan y el hijo ya te lo he dicho.",
    "pista": "Presta atención a la estructura de la frase que se usa para describir al hijo.",
    "respuesta": "El hijo se llama Esteban. (La frase 'el hijo ya te lo he dicho' se refiere al nombre 'Esteban'.)"
  },
  {
    "id": 148,
    "acertijo": "¿De qué color es el caballo blanco de Santiago?",
    "pista": "La respuesta está en la pregunta.",
    "respuesta": "Blanco."
  },
  {
    "id": 149,
    "acertijo": "¿Qué hay en el centro de París?",
    "pista": "Mira la palabra París y concéntrate en la letra del medio.",
    "respuesta": "La R."
  },
  {
    "id": 150,
    "acertijo": "Tienes una vela encendida y dos cuerdas. Cada cuerda tarda exactamente 1 hora en quemarse, pero no queman de manera uniforme. ¿Cómo puedes medir exactamente 45 minutos usando estas cuerdas y la vela?",
    "pista": "La clave es encender la primera cuerda por ambos extremos y la segunda cuerda en el momento preciso.",
    "respuesta": "Enciendes ambas cuerdas por ambos extremos. Cuando una cuerda se queme por completo (30 minutos), enciendes el otro extremo de la segunda cuerda. Cuando esta se queme, habrán pasado 15 minutos más, sumando $30 + 15 = 45$ minutos."
  }
]
